import { dictionary } from "./en";

const FA_Dictionary: dictionary = {
  fullname: "آرمین یحیی",
  role: "Frontend Developer",
  about_me: "درباره من",
  about_me_content: `خوش شانس بودم که تونستم از ابتدا با افراد باتجربه کار کنم و ازشون یاد بگیرم. مسئولیت پذیر و پرتلاش هستم. `,
  skills: "مهارت‌ها",
  skills_content: "",
  past_experiences: "سوابق کاری",
  chargoon: "چارگون",
  "2020April": "۱۳۹۹",
  "2020March": "۱۳۹۹",
  present: "هم اکنون",
  chargoon_work_description:
    "چارگون یک شرکت نرم افزاریه که نرم افزارهای اداری تحت وب بصورت enterprise تولید میکنه. من فعالیت خودم رو در تیم زیرساخت چارگون شروع کردم. این تیم وظیفه تولید قسمت هایی رو داره که در نرم افزارهای مختلف استفاده میشند. مثل فریمورک رابط کاربری و پروژه هایی که میتونند بدون دونستن بیزینس استفاده کننده توسعه پیدا کنند. برای task management از azure devops استفاده میکنیم. داکر سرور خودمون رو داریم که باهاش تاپیک برنچ هارو تست میکنیم. از React, Typescript استفاده میکنیم. از کارهای جالبی که انجام دادم بخوام بگم خورد کردن فریمورک رابط کاربری به پیکج های کوچیک، ساخت یک محیط دیاگرامی داخل نرم افزار با GoJS برای طراحی دیتابیس، توسعه یک فرم ساز پیشرفته با قابلیت های زیاد و همچنین مهاجرت از state management قدیمی به Redux Toolkit",
  yeganeh_soft: "یگانه",
  "2018": "۱۳۹۷",
  yeganeh_soft_description:
    "شرکت یگانه اولین تجربه کاری من بود و در اونجا نرم افزارای تحت وب مکاتبات و اسناد تولید کردیم. پروژه ها با React, Typescript نوشته میشدند و من اولین بار اونجا با Typescript آشنا شدم. برای task management از trello استفاده میکردیم. صفحاتمون رو با استفاده از فریمورک AntDesign توسعه دادیم. یکسری از صفحاتمون هم بود که براشون کامپوننت آماده وجود نداشت و خودمون توسعه میدادیم. اولین بار توی تیم یگانه با مفهموم UX آشنا شدم و با کارشناس UX تیم تعامل میکردیم تا پیاده سازی صفحه به همون شکلی باشه که تجربه کاربری بهتری داره",
  see_gallery: "مشاهده گالری",
  birthDate: "تولد",
  location: "آدرس",
  militaryService: "سربازی",
  birthDateValue: "۱۳۷۷/۶/۱۳",
  tehran: "تهران",
  finished: "پایان یافته",
  email: "ایمیل",
  "As an infrastructure team member, I participate in migrating to Redux Toolkit from MobX":
    "به عنوان عضوی از تیم فرانت بخش زیرساخت در مهاجرت از mobx state management به redux نقش داشتم.",
  "I documented some projects on the knowledgebase to help other team members or company engineers":
    "تعدادی از پیاده سازی‌‌های انجام شده را مستند کردم و در اختیار بقیه توسعه دهنده‌های شرکت قرار دادم.",
  "Designed a diagram environment using the GoJS library to create database schemas":
    "یک محیط دیاگرامی با استفاده از کتابخانه gojs ایجاد کردم تا بتونیم از داخل برنامه data model طراحی کنیم.",
  "Helped new Infrastructure team members get familiar with the codebase":
    "به اعضای جدید تیم کمک میکردم تا با code base شرکت آشنا بشن.",
  "Created a simple form generator for software that doesn’t need a complex form designer":
    " یک فرم ساز ساده در کنار فرم ساز قبلی توسعه دادم تا نیاز تیم‌هایی که به فیچرهای پیچیده نیازی نداشتند تامین بشه.",
  "As a member of the infrastructure team, I successfully resolved issues that were reported by other teams":
    "به عنوان عضوی از تیم زیرساخت ایشوهایی (issue) که توسط تیم های دیگه ثبت میشد رو حل میکردم.",
  "I also introduced a new tool for generating TypeScript from C# models":
    "در استفاده و جایگزینی یک ابزار جدید برای تبدیل مدل‌‌های c# به typescript نقش داشتم.",
  "I refactored LESS styles to utilize CSS variables for theming":
    "استایل‌های LESS رو ریفکتور کردم تا برای them از css variables استفاده کنن.",
  "I improved the performance of certain components (such as the tree) to handle large amounts of data more efficiently":
    "بعضی از کامپوننت‌هارو (مثل درخت) تغییر دادم تا با اطلاعات ورودی زیاد هم performance خوبی داشته باشند.",
  "I familiarized myself with the Ant Design framework":
    "با کامپوننت‌های مختلف Ant Design آشنا شدم.",
  "Collaborated closely with a UI designer as a frontend developer":
    "به عنوان یک Frontend Developer با همکار بخش UI/UX تعامل داشتم تا صفحات به شکل مورد تایید پیاده سازی بشن.",
  "Participated in creating both a Document Manager and EDMS Software, both of which are web-based":
    "در تولید دو نرم افزار دبیرخانه و مدیریت اسناد نقش داشتم.",
    "I collaborated on migrating to the new major versions of packages such as React, TypeScript, Webpack, and others": "من و سایر اعضای تیم ورژن پکیج هایی مثل React ، Typescript و Webpack رو بروز میکردیم تا بتونیم از قابلیت‌های جدیدشون استفاده کنیم. همچنین تغییراتی که توی Migation Guide توضیح میدادن رو در پروژه‌ها اعمال میکردیم.",
    "2024September": "شهریور ۱۴۰۳",
    gallery_chargoon_modeler: "توضیحات مربوط به فرم ساز پیشرفته: میخوایم از داخل برنامه یدونه فرم طراحی کنیم. این فرم مربوط به دانش آموزای یک مدرسه هست. قدم اول طراحی فرممون میشه طراحی مدل اطلاعاتی چون بالاخره باید اطلاعات مربوط به دانش آموز، کلاس و سابقه تحصیلی رو یجا ذخیره کنیم دیگه. جداول و رابطه هایی که داخل صفحه میبینید با استفاده از کتابخانه gojs پیاده سازی شدند.",
    gallery_chargoon_designer: "این صفحه که طراحی فرم نام داره جاییه که چیدمان فرم و اینکه کدوم فیلدا اجباری هستند تنظیم میشه. همچنین میتونید برای نمایش یا ویرایش فیلد ویجت های مختلف انتخاب کنید.",
    gallery_chargoon_designer_setting: "این تصویر بخشی از تنظیمات یک فیلد رو نمایش میده.",
    gallery_chargoon_output: "فرمی که در تصاویر قبلی طراحی کردیم در آخر به این شکل نمایش داده میشه.",
    gallery_chargoon_designer_new_fields: `این فرم 2 قابلیت جالب هم داره که میخوام بهتون توضیح بدم. اولی قابلیت اعتبار سنجی پیچیده هست. با استفاده از این قابلیت شما میتونید مقدار یک فیلد رو براساس مقدار فیلد دیگه اعتبار سنجی کنید.
قابلیت دوم عملیات بر رخداد هست. به کمک این قابلیت شما میتونید بر اساس مقدار یک فیلد، فیلد دیگری رو اجباری کنید.
برای اینکه بتونم این قابلیت رو بهتون نمایش بدم 4 فیلد پایه تحصیلی، رشته ورزشی، موضوع تحقیق و هم گروهی تحقیق رو به مدل اطلاعاتی دانش آموزان اضافه کردم. فرض کنیم که مدرسه میخواد این شرط رو برای دانش آموزاش بزاره که دانش آموزای کلاس اول فقط توی رشته های کم خطر مثل دو میدانی شرکت کنن.
`,
    gallery_chargoon_complex_validation_tab: "به تب اعتبارسنجی میرویم. اینجا من از قبل اعتبارسنجی ای که توضیح دادم رو ایجاد کردم.",
    gallery_chargoon_design_complex_validation: `اینجا اومدم و یک شرط ایجاد کردم. نوشتم که اگه پایه تحصیلی برابر کلاس اول بود و رشته تحصیلی چیزی جز دو بود به کاربر وارد کننده اطلاعات پیام "برای سال اولی ها فقط رشته دو مجاز است" رو نمایش بده. برای دیدن خروجی تا ویدیو آخر صبر کنید.`,
    gallery_chargoon_design_operation_on_events: `حالا میریم سراغ عملیات بررخداد و دو فیلد موضوع تحقیق و هم گروهی تحقیق. فرض کنید بخواید روی فرمتون این کنترل رو داشته باشید که اگه موضوع تحقیق مشخص شده بود حتما هم گروهی تحقیق هم باید پر بشه. ولی اگه موضوع تحقیق پر نشده بود یا دانش آموز هنوز موضوع تحقیقش رو انتخاب کرده نکرده بود میتونیم دو فیلد رو خالی بزاریم. توی این تصویر بکمک ابزار شرط ساز اومدم و این شرط رو نوشتم که اگه مقدار موضوع تحقیق تغییر کرد، برو و فیلد هم گروهی تحقیق رو اجباری کن.`,
    gallery_chargoon_output_video: `این خروجی فرممون هست که داره توسط کاربر پر میشه. به ویدیو دقت کنید اگه دانش آموز کلاس اولی باشه و رشته فوتبال رو انتخاب کنه بهش پیغام میده و همچین اگه موضوع تحقیق رو پر کنه بلافاصله فیلد هم گروهی تحقیق اجباری میشه.`,
    next: `بعدی`,
    previous: `قبلی`,
    loading: 'منتظر بمانید',
    gallery_yeganeh_dabirkhone_orgchart: `در‌‌‌‌‌‌ این تصویر سمت‌ های سازمانی رو میبینید که به شیوه ی منوهای تو در تو نمایش داده میشن. هر سمت ممکنه سمت هایی به عنوان زیرشاخه داشته باشه. همونطور که میبینید وقتی کاربر روی مدیر تولید کلیک میکنه، در ستون بعدی سمت های زیر مجموعه اون یعنی برنامه نویس ها نمایش داده میشوند.`,
    gallery_yeganeh_dabirkhone_cartable: `این صفحه محل نمایش نامه های دریافتی کاربر است. تفکیک نامه ها در کارتابل کاربر با استفاده از رنگ کنار کارد صورت گرفته. در این صفحه کاربر میتونه روی نامه ها جستجو یا فیلتر انجام بده. به تاریخ بالای کاردها(Cards) دقت کنید. ممکنه کاربر چندین نامه در طول روز دریافت کنه. نامه های کاربر بر اساس روز گروه بندی میشوند تا پیدا کردنشون برای کاربر راحتتر باشه.`,
    gallery_yeganeh_dabirkhone_adduser: `این مودال برای افزودن کاربر به برنامه است. همونطور که میبینید این مودال 
UI خاصی داره که توسط تیم UI/UX طراحی شده است.
`,
    gallery_yeganeh_old_dabirkhone_add_letter: `فرم مربوط به افزودن نامه که با استفاده از کتابخانه Ant Design پیاده سازی شده است. این برنامه نسخه اولیه دبیرخانه شرکت یگانه بود که بعدا طراحی جدیدی رو جایگزین این طراحی کردند.`,
    gallery_yeganeh_edms_orgchart: `این تصویر مربوط به نمایش سمت های سازمانی در نرم افزار مدیریت اسناد است.`,
    gallery_yeganeh_edms_documentgroup: `فرم ورود اطلاعات برای یکی از موجودیت های نرم افزار اسناد.`,
  };

export default FA_Dictionary;
