import { dictionary } from "./en";

const FA_Dictionary: dictionary = {
  fullname: "آرمین یحیی",
  role: "Frontend Developer",
  about_me: "درباره من",
  about_me_content: `خوش شانس بودم که تونستم از ابتدا با افراد باتجربه کار کنم و ازشون یاد بگیرم. مسئولیت پذیر هستم و توی دیباگ کردن خوبم 🙂. `,
  skills: "مهارت‌ها",
  skills_content: "",
  past_experiences: "سوابق کاری",
  chargoon: "چارگون",
  "2020April": "۱۳۹۹",
  "2020March": "۱۳۹۹",
  present: "هم اکنون",
  chargoon_work_description:
    "چارگون یک شرکت نرم افزاریه که نرم افزارهای اداری تحت وب بصورت enterprise تولید میکنه. من فعالیت خودم رو در تیم زیرساخت چارگون شروع کردم. این تیم وظیفه تولید قسمت هایی رو داره که در نرم افزارهای مختلف استفاده میشند. مثل فریمورک رابط کاربری و پروژه هایی که میتونند بدون دونستن بیزینس استفاده کننده توسعه پیدا کنند. برای task management از azure devops استفاده میکنیم. داکر سرور خودمون رو داریم که باهاش تاپیک برنچ هارو تست میکنیم. از React, Typescript استفاده میکنیم. از کارهای جالبی که انجام دادم بخوام بگم خورد کردن فریمورک رابط کاربری به پیکج های کوچیک، ساخت یک محیط دیاگرامی داخل نرم افزار با GoJS برای طراحی دیتابیس، توسعه یک فرم ساز پیشرفته با قابلیت های زیاد و همچنین مهاجرت از state management قدیمی به Redux Toolkit",
  yeganeh_soft: "یگانه",
  "2018": "۱۳۹۷",
  yeganeh_soft_description:
    "شرکت یگانه اولین تجربه کاری من بود و در اونجا نرم افزارای تحت وب مکاتبات و اسناد تولید کردیم. پروژه ها با React, Typescript نوشته میشدند و من اولین بار اونجا با Typescript آشنا شدم. برای task management از trello استفاده میکردیم. صفحاتمون رو با استفاده از فریمورک AntDesign توسعه دادیم. یکسری از صفحاتمون هم بود که براشون کامپوننت آماده وجود نداشت و خودمون توسعه میدادیم. اولین بار توی تیم یگانه با مفهموم UX آشنا شدم و با کارشناس UX تیم تعامل میکردیم تا پیاده سازی صفحه به همون شکلی باشه که تجربه کاربری بهتری داره",
  see_gallery: "مشاهده گالری",
  birthDate: "تولد",
  location: "آدرس",
  militaryService: "سربازی",
  birthDateValue: "۱۳۷۷/۶/۱۳",
  tehran: "تهران",
  finished: "پایان یافته",
  email: "ایمیل",
  "As an infrastructure team member, I participate in migrating to Redux Toolkit from MobX":
    "به عنوان عضوی از تیم فرانت بخش زیرساخت در مهاجرت از mobx state management به redux نقش داشتم.",
  "I documented some projects on the knowledgebase to help other team members or company engineers":
    "تعدادی از پیاده سازی‌‌های انجام شده را مستند کردم و در اختیار بقیه توسعه دهنده‌های شرکت قرار دادم.",
  "Designed a diagram environment using the GoJS library to create database schemas":
    "یک محیط دیاگرامی با استفاده از کتابخانه gojs ایجاد کردم تا بتونیم از داخل برنامه data model طراحی کنیم.",
  "Helped new Infrastructure team members get familiar with the codebase":
    "به اعضای جدید تیم کمک میکردم تا با code base شرکت آشنا بشن.",
  "Created a simple form generator for software that doesn’t need a complex form designer":
    " یک فرم ساز ساده در کنار فرم ساز قبلی توسعه دادم تا نیاز تیم‌هایی که به فیچرهای پیچیده نیازی نداشتند تامین بشه.",
  "As a member of the infrastructure team, I successfully resolved issues that were reported by other teams":
    "به عنوان عضوی از تیم زیرساخت ایشوهایی (issue) که توسط تیم های دیگه ثبت میشد رو حل میکردم.",
  "I also introduced a new tool for generating TypeScript from C# models":
    "در استفاده و جایگزینی یک ابزار جدید برای تبدیل مدل‌‌های c# به typescript نقش داشتم.",
  "I refactored LESS styles to utilize CSS variables for theming":
    "استایل‌های LESS رو ریفکتور کردم تا برای them از css variables استفاده کنن.",
  "I created a custom AJAX solution to replace jQuery AJAX throughout the software":
    "یک ajax شخصی سازی شده نوشتم تا جایگزین jquery ajax بشه و در تمام نرم افزارها استفاده بشه.",
  "I improved the performance of certain components (such as the tree) to handle large amounts of data more efficiently":
    "بعضی از کامپوننت‌هارو (مثل درخت) تغییر دادم تا با اطلاعات ورودی زیاد هم performance خوبی داشته باشند.",
  "I familiarized myself with the Ant Design framework":
    "با کامپوننت‌های مختلف Ant Design آشنا شدم.",
  "Collaborated closely with a UI designer as a frontend developer":
    "به عنوان یک Frontend Developer با همکار بخش UI/UX تعامل داشتم تا صفحات به شکل مورد تایید پیاده سازی بشن.",
  "Participated in creating both a Document Manager and EDMS Software, both of which are web-based":
    "در تولید دو نرم افزار دبیرخانه و مدیریت اسناد نقش داشتم.",
};

export default FA_Dictionary;
