import { dictionary } from "./en";

const FA_Dictionary: dictionary = {
	fullname: 'آرمین یحیی',
	role: 'Frontend Developer',
	about_me: 'درباره من',
	about_me_content: `خوش شانس بودم که تونستم از ابتدا با افراد باتجربه کار کنم و ازشون یاد بگیرم. مسئولیت پذیر هستم و توی دیباگ کردن خوبم 🙂. `,
	skills: 'مهارت‌ها',
	skills_content: '',
	past_experiences: 'سوابق کاری',
	chargoon: 'چارگون',
	'2020April': '۱۴۰۰',
	'2020March': '۱۳۹۹',
	present: 'هم اکنون',
	chargoon_work_description: 'چارگون یک شرکت نرم افزاریه که نرم افزارهای اداری تحت وب بصورت enterprise تولید میکنه. من فعالیت خودم رو در تیم زیرساخت چارگون شروع کردم. این تیم وظیفه تولید قسمت هایی رو داره که در نرم افزارهای مختلف استفاده میشند. مثل فریمورک رابط کاربری و پروژه هایی که میتونند بدون دونستن بیزینس استفاده کننده توسعه پیدا کنند. برای task management از azure devops استفاده میکنیم. داکر سرور خودمون رو داریم که باهاش تاپیک برنچ هارو تست میکنیم. از React, Typescript استفاده میکنیم. از کارهای جالبی که انجام دادم بخوام بگم خورد کردن فریمورک رابط کاربری به پیکج های کوچیک، ساخت یک محیط دیاگرامی داخل نرم افزار با GoJS برای طراحی دیتابیس، توسعه یک فرم ساز پیشرفته با قابلیت های زیاد و همچنین مهاجرت از state management قدیمی به Redux Toolkit.',
	yeganeh_soft: 'یگانه',
	'2018': '۱۳۹۷',
	yeganeh_soft_description: 'شرکت یگانه اولین تجربه کاری من بود و در اونجا نرم افزارای تحت وب مکاتبات و اسناد تولید کردیم. پروژه ها با React, Typescript نوشته میشدند و من اولین بار اونجا با Typescript آشنا شدم. برای task management از trello استفاده میکردیم. صفحاتمون رو با استفاده از فریمورک AntDesign توسعه دادیم. یکسری از صفحاتمون هم بود که براشون کامپوننت آماده وجود نداشت و خودمون توسعه میدادیم. اولین بار توی تیم یگانه با مفهموم UX آشنا شدم و با کارشناس UX تیم تعامل میکردیم تا پیاده سازی صفحه به همون شکلی باشه که تجربه کاربری بهتری داره.',
	see_gallery: 'مشاهده گالری',
	birthDate: 'تولد',
	location: 'آدرس',
	militaryService: 'سربازی',
	birthDateValue: '۱۳۷۷/۶/۱۳',
	tehran: 'تهران',
	finished: 'پایان یافته',
	email: 'ایمیل'
};

export default FA_Dictionary;