import { dictionary } from "./en";

const FA_Dictionary: dictionary = {
	fullname: 'آرمین یحیی',
	role: 'Frontend Developer',
	about_me: 'درباره من',
	about_me_content: `برنامه نویسی رو با Front End شروع کردم. خوش شانس بودم که تونستم از ابتدا با افراد باتجربه کار کنم و ازشون یاد بگیرم. بیشتر ورزش هارو دوست دارم و سعی میکنم همیشه توی هفته یه قسمتی از زمانم رو ورزش بکنم. کتاب‌ هایی که میخونم اکثرا توی زمینه توسعه فردی هستند 🙂`,
	skills: 'مهارت‌ها',
	skills_content: '',
	past_experiences: 'سوابق کاری',
	chargoon: 'چارگون',
	'2020': '۱۳۹۹',
	present: 'هم اکنون',
	chargoon_work_description: 'چارگون یک شرکت تولید کننده نرم افزارهای اداری تحت وبه که ویژگی خاصش در ارائه دادن تمام نرم افزارهاش در کنار یکدیگر و نه بصورت مجزاست. من فعالیت خودم رو در تیم زیرساخت چارگون شروع کردم که وظیفه تولید قسمت هایی رو داره که در نرم افزارهای مختلف استفاده میشن. مثل فریمورک رابط کاربری و پروژه هایی که میتونن بدون دونستن بیزینس استفاده کننده توسعه پیدا کنن. برای task management از azure devops استفاده میکنیم. داکر سرور خودمون رو داریم که باهاش تاپیک برنچ هارو تست میکنیم. استک فرانتمون React, Typescript هست. از کارهای جالبی که انجام دادم بخوام بگم خورد کردن فریمورک رابط کاربری به پیکج های کوچیک، ساخت یک محیط دیاگرامی داخل نرم افزار با GoJS برای طراحی دیتابیس و یک فرم ساز پیشرفته با قابلیت های زیاد و همچنین مهاجرت از state management قدیمی به Redux Toolkit بخاطر اینکه بروزرسانیشون اونقدرا به صرفه نبود. ',
	yeganeh_soft: 'یگانه',
	'2018': '۱۳۹۷',
	yeganeh_soft_description: 'شرکت یگانه اولین تجربه کاری من بود و اونجا نرم افزارای تحت وب مکاتبات و اسناد تولید کردیم. استک فرانتمون React, Typescript بود و من اولین بار اونجا با Typescript آشنا شدم. برای task management از trello استفاده میکردیم. صفحاتمون رو با استفاده از فریمورک AntDesign توسعه دادیم. یکسری از صفحاتمون هم بود که براشون کامپوننت آماده وجود نداشت و خودمون توسعه میدادیم. اولین بار توی تیم یگانه با مفهموم UX آشنا شدم و با کارشناس UX تیم تعامل میکردیم تا پیاده سازی صفحه به همون شکلی باشه که تجربه کاربری بهتری داره.',
	see_gallery: 'مشاهده گالری',
	birthDate: 'تولد',
	location: 'آدرس',
	militaryService: 'سربازی',
	birthDateValue: '۱۳۷۷/۶/۱۳',
	tehran: 'تهران',
	finished: 'پایان یافته',
	email: 'ایمیل'
};

export default FA_Dictionary;